<template>
	<div class="learn-page">
		<!-- TODO: Сделать возможность добавления\удаления\изучения новых слов (в хедере) -->
		<!-- TODO: Сделать возможность перетаскивание (смену приоритета) изучаемых слов, или отдельный список активно изучаемых слов, которые будут попадатся на практике -->
		<!-- TODO: Отображать прогресс изученности для каждого слова -->

		<h1 style="color:#0a2145;">Пользовательский словарь</h1>
		<BaseAutocomplite :items="words" :autoselect="true" :multiple="true" @change="onSearch" @update:modelValue="onSearch" placeholder="Поиск" />

		<section class="tags">
			<div class="tag" v-for="(tag, index) of tags" :key="tag.key" :class="{ 'selected': index === 4 }">
				<span v-html="tag.icon" style="margin-right:.4em;"></span>
				<span class="name">{{ tag.name }}</span>
			</div>
		</section>

		<!-- <section class="tags">
			<div class="tag" v-for="(tag, index) of tags" :key="tag.key" :class="{ 'selected': index === 4 }">
				<span v-html="tag.icon" style="margin-right:.4em;"></span>
				<span class="name">{{ tag.name }}</span>
			</div>
		</section> -->



		<section class="words-list">
			<div class="word" v-for="word of words" :key="word.name" style="display:flex;">
				<div class="word-left-side">
					<BaseIcon :name="defineIcon(word)" style="margin-right:.8em;" size="50"/>
					<section>
						<!-- <div class="word-types"><span v-for="i of 2" :key="i">Глагол</span></div> -->
						<div class="word-name">{{ word.name }}</div>
						<div class="word-forms" style="
							display: flex;
							gap: .4em;
							font-size: .9em;
						">
							<div title="V1 is the base form of the verb" style="
							background: #eaeaea;
							border-radius: 4px;
							padding: .2em .6em;
						">Arise</div>
							<div title="V2 is the simple past form; it is formed by adding -ed to the base form" style="
							background: #eaeaea;
							border-radius: 4px;
							padding: .2em .6em;
						">Arose</div>
							<div title="V3 is the past participle form; it is formed by adding -ed to the base form" style="
							background: #eaeaea;
							border-radius: 4px;
							padding: .2em .6em;
						">Arisen</div>
							<div title="V4 is the third-person singular present form; it is formed by adding -s to the base form" style="
							background: #2186eb1f;
							border-radius: 4px;
							padding: .2em .6em;
							color: #2265a9;
						">Arises</div>
							<div title="V5 is the present participle form; it is formed by adding -ing to the base form" style="
								background: #b921eb1f;
								border-radius: 4px;
								padding: .2em .6em;
								color: #a122a9;
						">Arising</div>
						</div>
					</section>
				</div>
				<div class="word-right-side">
					<section>
						<div class="word-types">
							<template v-for="wordType of [`Глагол`, `Существительное`, `Местоимение`]" :key="wordType">
								<div class="word-type" v-if="Math.random() < 0.5">{{ wordType }}</div>
							</template>
						</div>
						<div class="word-translations">
							<div class="word-translation" v-for="(translation, index) of String(word.translation).split(',')" :key="index">{{ translation }}</div>
						</div>
					</section>
				</div>
			</div>
		</section>
	</div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';
import BaseIcon from '../common/Base/BaseIcon.vue';
import BaseAutocomplite from '../common/Base/BaseAutocomplite.vue';
import LearningProgress from '../common/LearningProgress.vue';

export default defineComponent({
	name: 'LearnPage',
	components: { BaseIcon, BaseAutocomplite, LearningProgress },
	data() {
		return {
			tags: [
				{ key: ``, name: `Все` },
				{ key: `nouns`, name: `Существительные`, icon: `<svg style="vertical-align:middle; fill:currentColor;" width="1.4em" height="1.4em" viewBox="-2.4 -2.4 28.80 28.80" fill="none" transform="rotate(0)matrix(-1, 0, 0, 1, 0, 0)"><path fill-rule="evenodd" clip-rule="evenodd" d="M12 1.25C11.3953 1.25 10.8384 1.40029 10.2288 1.65242C9.64008 1.89588 8.95633 2.25471 8.1049 2.70153L6.03739 3.78651C4.99242 4.33487 4.15616 4.77371 3.51047 5.20491C2.84154 5.65164 2.32632 6.12201 1.95112 6.75918C1.57718 7.39421 1.40896 8.08184 1.32829 8.90072C1.24999 9.69558 1.24999 10.6731 1.25 11.9026V12.0974C1.24999 13.3268 1.24999 14.3044 1.32829 15.0993C1.40896 15.9182 1.57718 16.6058 1.95112 17.2408C2.32632 17.878 2.84154 18.3484 3.51047 18.7951C4.15616 19.2263 4.99241 19.6651 6.03737 20.2135L8.10481 21.2984C8.95628 21.7453 9.64006 22.1041 10.2288 22.3476C10.8384 22.5997 11.3953 22.75 12 22.75C12.6047 22.75 13.1616 22.5997 13.7712 22.3476C14.3599 22.1041 15.0437 21.7453 15.8951 21.2985L17.9626 20.2135C19.0076 19.6651 19.8438 19.2263 20.4895 18.7951C21.1585 18.3484 21.6737 17.878 22.0489 17.2408C22.4228 16.6058 22.591 15.9182 22.6717 15.0993C22.75 14.3044 22.75 13.3269 22.75 12.0975V11.9025C22.75 10.6731 22.75 9.69557 22.6717 8.90072C22.591 8.08184 22.4228 7.39421 22.0489 6.75918C21.6737 6.12201 21.1585 5.65164 20.4895 5.20491C19.8438 4.77371 19.0076 4.33487 17.9626 3.7865L15.8951 2.70154C15.0437 2.25472 14.3599 1.89589 13.7712 1.65242C13.1616 1.40029 12.6047 1.25 12 1.25ZM8.7708 4.04608C9.66052 3.57917 10.284 3.2528 10.802 3.03856C11.3062 2.83004 11.6605 2.75 12 2.75C12.3395 2.75 12.6938 2.83004 13.198 3.03856C13.716 3.2528 14.3395 3.57917 15.2292 4.04608L17.2292 5.09563C18.3189 5.66748 19.0845 6.07032 19.6565 6.45232C19.9387 6.64078 20.1604 6.81578 20.3395 6.99174L17.0088 8.65708L8.50895 4.18349L8.7708 4.04608ZM6.94466 5.00439L6.7708 5.09563C5.68111 5.66747 4.91553 6.07032 4.34352 6.45232C4.06131 6.64078 3.83956 6.81578 3.66054 6.99174L12 11.1615L15.3572 9.48289L7.15069 5.16369C7.07096 5.12173 7.00191 5.06743 6.94466 5.00439ZM2.93768 8.30737C2.88718 8.52125 2.84901 8.76413 2.82106 9.04778C2.75084 9.7606 2.75 10.6644 2.75 11.9415V12.0585C2.75 13.3356 2.75084 14.2394 2.82106 14.9522C2.88974 15.6494 3.02022 16.1002 3.24367 16.4797C3.46587 16.857 3.78727 17.1762 4.34352 17.5477C4.91553 17.9297 5.68111 18.3325 6.7708 18.9044L8.7708 19.9539C9.66052 20.4208 10.284 20.7472 10.802 20.9614C10.9656 21.0291 11.1134 21.0832 11.25 21.1255V12.4635L2.93768 8.30737ZM12.75 21.1255C12.8866 21.0832 13.0344 21.0291 13.198 20.9614C13.716 20.7472 14.3395 20.4208 15.2292 19.9539L17.2292 18.9044C18.3189 18.3325 19.0845 17.9297 19.6565 17.5477C20.2127 17.1762 20.5341 16.857 20.7563 16.4797C20.9798 16.1002 21.1103 15.6494 21.1789 14.9522C21.2492 14.2394 21.25 13.3356 21.25 12.0585V11.9415C21.25 10.6644 21.2492 9.7606 21.1789 9.04778C21.151 8.76412 21.1128 8.52125 21.0623 8.30736L17.75 9.96352V13C17.75 13.4142 17.4142 13.75 17 13.75C16.5858 13.75 16.25 13.4142 16.25 13V10.7135L12.75 12.4635V21.1255Z"></path></svg>` },
				{ key: `verbs`, name: `Глаголы`, icon: `<svg style="vertical-align:middle; stroke:currentColor;" width="1.4em" height="1.4em" viewBox="0 0 24 24" fill="none" transform="matrix(1, 0, 0, 1, 0, 0)"><path d="M14.5 16.5H16.1152C16.9825 16.5 17.7946 16.0745 18.2883 15.3614L21.6315 10.5323C21.8588 10.204 21.889 9.77803 21.7105 9.42094C21.3678 8.73545 20.4444 8.60613 19.9265 9.17109L17.2727 12.0661C16.2059 13.23 14.5301 13.612 13.0643 13.0257L9.44043 11.5762C8.53873 11.2155 7.51727 11.3218 6.70922 11.8605L2.87237 14.4184C2.37401 14.7507 2.20104 15.402 2.4689 15.9377C2.76223 16.5244 3.47562 16.7622 4.06229 16.4689L7.24772 14.8762C7.86821 14.5659 8.54577 15.1811 8.29674 15.8286L6.50003 20.5M7.00003 4H4.00003M6.00003 7H4.00003M18 6.5C18 8.70914 16.2092 10.5 14 10.5C11.7909 10.5 10 8.70914 10 6.5C10 4.29086 11.7909 2.5 14 2.5C16.2092 2.5 18 4.29086 18 6.5Z" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.4"></path></svg>`,
					subtags: [
						{ key: `simple-verbs`, name: `Простые глаголы` },
						{ key: `complex-verbs`, name: `Сложные глаголы` },
						{ key: `irregular-verbs`, name: `Неправильные глаголы` },
						{ key: `auxiliary-verbs`, name: `Дополнительные глаголы` },
						{ key: `phrasal-verbs`, name: `Фразовые глаголы` },
						{ key: `gerund-verbs`, name: `Герунды` },
						{ key: `infinitive-verbs`, name: `Инфинитивы` },
						{ key: `modal-verbs`, name: `Модальные глаголы` },
						{ key: `past-verbs`, name: `Прошедшие глаголы` },
						{ key: `present-verbs`, name: `Настоящие глаголы` },
						{ key: `future-verbs`, name: `Будущие глаголы` },
						{ key: `conditional-verbs`, name: `Условные глаголы` },
						{ key: `imperative-verbs`, name: `Императивные глаголы` },
						{ key: `participle-verbs`, name: `Частица` },
					]
				},
				{ key: `adjectives`, name: `Прилагательные`, icon: `<svg style="vertical-align:middle; stroke:currentColor;" width="1.4em" height="1.4em" viewBox="1 2 33 30"><path d="M 9.648 3.888 A 0.144 0.144 90 0 0 10.224 13.392 A 0.144 0.144 90 0 0 9.648 3.888 Z M 18.72 13.968 C 17.136 12.816 12.528 13.824 12.96 16.272 L 21.312 28.512 L 21.456 34.128 L 18 41.76 C 17.28 43.92 20.016 45.936 21.888 44.064 L 25.92 35.568 L 26.064 31.68 L 29.376 35.712 L 28.512 42.048 C 28.512 45.072 32.4 45.648 32.976 42.768 L 34.56 34.272 L 30.96 29.952 M 14.832 19.008 L 20.88 24.192 L 30.096 29.52 C 31.68 30.24 34.128 28.08 32.112 26.208 L 24.624 22.32 L 18.576 17.424 M 21.888 15.408 L 35.568 9.216 L 42.048 22.608 L 33.408 26.784 L 25.056 22.032 Z M 15.408 2.736 C 16.272 1.584 17.856 1.008 19.44 1.584 C 20.016 3.888 16.416 2.16 15.408 2.736 Z M 3.6 11.952 C 3.6 13.536 4.032 14.688 3.6 15.552 C 3.312 16.272 2.592 16.416 2.304 15.552 C 2.016 14.4 2.16 12.96 3.6 11.952 Z" stroke-width="1.6" fill="none"/></svg>` },
				{ key: `adverbs`, name: `Наречия`, icon: `<svg style="vertical-align:middle; fill:currentColor;" width="1.4em" height="1.4em" viewBox="0 0 24 24"><path stroke-linecap="round" stroke-linejoin="round" stroke-width="1.4" fill-rule="evenodd" clip-rule="evenodd" d="M13.6882 4.14229L14.6516 5.10571C14.9445 5.3986 14.9445 5.87348 14.6516 6.16637C14.3588 6.45926 13.8839 6.45926 13.591 6.16637L12.6269 5.20228L11.5662 6.26294L13.2374 7.93414C13.5303 8.22703 13.5303 8.7019 13.2374 8.9948C12.9445 9.28769 12.4697 9.28769 12.1768 8.9948L10.5056 7.3236L9.44492 8.38426L10.409 9.34835C10.7019 9.64124 10.7019 10.1161 10.409 10.409C10.1161 10.7019 9.64124 10.7019 9.34835 10.409L8.38426 9.44492L7.3236 10.5056L8.9948 12.1768C9.28769 12.4697 9.28769 12.9445 8.9948 13.2374C8.7019 13.5303 8.22703 13.5303 7.93414 13.2374L6.26294 11.5662L5.20228 12.6269L6.16637 13.591C6.45926 13.8839 6.45926 14.3588 6.16637 14.6516C5.87348 14.9445 5.3986 14.9445 5.10571 14.6516L4.14229 13.6882C3.67802 14.1568 3.34308 14.5094 3.10761 14.818C2.81761 15.1981 2.75 15.422 2.75 15.6157C2.75 15.8094 2.81762 16.0334 3.10761 16.4135C3.41081 16.8109 3.87892 17.2812 4.5757 17.978L6.022 19.4243C6.71878 20.1211 7.18914 20.5892 7.58653 20.8924C7.96662 21.1824 8.19057 21.25 8.38426 21.25C8.57795 21.25 8.8019 21.1824 9.18198 20.8924C9.57938 20.5892 10.0497 20.1211 10.7465 19.4243L19.4243 10.7465C20.1211 10.0497 20.5892 9.57938 20.8924 9.18198C21.1824 8.8019 21.25 8.57795 21.25 8.38426C21.25 8.19057 21.1824 7.96662 20.8924 7.58653C20.5892 7.18914 20.1211 6.71878 19.4243 6.022L17.978 4.5757C17.2812 3.87892 16.8109 3.41081 16.4135 3.10761C16.0334 2.81762 15.8094 2.75 15.6157 2.75C15.422 2.75 15.1981 2.81761 14.818 3.10761C14.5094 3.34308 14.1568 3.67802 13.6882 4.14229ZM13.9081 1.91508C14.4217 1.52328 14.9622 1.25 15.6157 1.25C16.2693 1.25 16.8098 1.52328 17.3233 1.91508C17.8104 2.28666 18.3514 2.82777 19.0017 3.47812L20.5219 4.99824C21.1722 5.64856 21.7133 6.18964 22.0849 6.67666C22.4767 7.19017 22.75 7.73073 22.75 8.38426C22.75 9.03779 22.4767 9.57834 22.0849 10.0919C21.7133 10.5789 21.1722 11.12 20.5219 11.7703L11.7703 20.5219C11.12 21.1722 10.5789 21.7133 10.0919 22.0849C9.57834 22.4767 9.03779 22.75 8.38426 22.75C7.73073 22.75 7.19017 22.4767 6.67666 22.0849C6.18964 21.7133 5.64856 21.1722 4.99824 20.5219L3.47812 19.0017C2.82777 18.3514 2.28666 17.8104 1.91508 17.3233C1.52328 16.8098 1.25 16.2693 1.25 15.6157C1.25 14.9622 1.52328 14.4217 1.91508 13.9081C2.28667 13.4211 2.82779 12.88 3.47816 12.2297L12.2297 3.47815C12.88 2.82778 13.4211 2.28666 13.9081 1.91508Z"/></svg>` },
				{ key: `prepositions`, name: `Предлоги`, icon: `<svg style="vertical-align:middle; stroke:currentColor;" width="1.4em" height="1.4em" viewBox="0 0 24 24" fill="none"><path d="M7 21V18M14 21V17.6599C14 16.6974 14.6855 15.8715 15.6314 15.6941L21.1085 14.6672C21.6254 14.5702 22 14.1189 22 13.5929C22 12.9893 21.5107 12.5 20.9071 12.5H9.5C6.18629 12.5 3.5 15.1863 3.5 18.5V21M21 8L19 6M21 8L19 10.2592M21 8H16.5M14 6.5C14 8.70914 12.2091 10.5 10 10.5C7.79086 10.5 6 8.70914 6 6.5C6 4.29086 7.79086 2.5 10 2.5C12.2091 2.5 14 4.29086 14 6.5Z" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.4"></path></svg>` },
				{ key: `pronouns`, name: `Местоимения`, icon: `<svg style="vertical-align:middle; stroke:currentColor;" width="1.4em" height="1.4em" viewBox="0 0 24 24" fill="none"><path d="M4 21V18.5C4 15.4624 6.46243 13 9.5 13H14.5C17.5376 13 20 15.4624 20 18.5V21M8 21V18M16 21V18M16 6.5C16 8.70914 14.2091 10.5 12 10.5C9.79086 10.5 8 8.70914 8 6.5C8 4.29086 9.79086 2.5 12 2.5C14.2091 2.5 16 4.29086 16 6.5Z" stroke-linecap="round" stroke-width="1.4"/></svg>` },
				{ key: `conjunctions`, name: `Союзы`, icon: `<svg style="vertical-align:middle; stroke:currentColor;" width="1.4em" height="1.4em" viewBox="-4.6378 -4.7981 64 37.56"><path d="M 1.3622 26.6022 C 1.6026 17.628 11.2578 11.7787 20.6328 10.6569 C 25.2801 9.9758 29.7272 9.9758 33.7736 10.5367 C 47.3151 13.1008 53.0442 20.3923 53.3648 26.6823 L 37.4194 26.6022 A 0.0401 0.0401 90 0 0 16.9468 26.7625 Z M 8.6938 14.9036 L 8.6938 6.6906 C 19.9116 -1.242 36.1774 0.0401 45.9129 6.6906 L 45.8328 15.0639 M 13.5415 3.9262 L 13.6617 12.2996 M 17.9084 2.4038 L 17.9886 11.0575 M 22.8764 1.4423 L 22.9564 10.2964 M 27.5237 1.2019 L 27.4035 10.0961 M 32.171 1.5625 L 32.171 10.3364 M 36.6581 2.4839 L 36.6581 11.1777 M 41.5059 4.2067 L 41.5059 12.8203" stroke-width="2" fill="none"/></svg>` },
				{ key: `numerals`, name: `Числительные`, icon: `<svg style="vertical-align:middle; fill:currentColor;" width="1.4em" height="1.4em" viewBox="0 0 56 56"><path d="M 13.7851 49.5742 L 42.2382 49.5742 C 47.1366 49.5742 49.5743 47.1367 49.5743 42.3086 L 49.5743 13.6914 C 49.5743 8.8633 47.1366 6.4258 42.2382 6.4258 L 13.7851 6.4258 C 8.9101 6.4258 6.4257 8.8398 6.4257 13.6914 L 6.4257 42.3086 C 6.4257 47.1602 8.9101 49.5742 13.7851 49.5742 Z M 13.8554 45.8008 C 11.5117 45.8008 10.1992 44.5586 10.1992 42.1211 L 10.1992 13.8789 C 10.1992 11.4414 11.5117 10.1992 13.8554 10.1992 L 42.1679 10.1992 C 44.4882 10.1992 45.8007 11.4414 45.8007 13.8789 L 45.8007 42.1211 C 45.8007 44.5586 44.4882 45.8008 42.1679 45.8008 Z M 21.9882 39.4023 C 22.9023 39.4023 23.4648 38.9336 23.6523 38.0664 L 24.7070 33.0274 L 29.0663 33.0274 L 28.1054 37.6211 C 27.8944 38.5820 28.5742 39.4023 29.5351 39.4023 C 30.4960 39.4023 31.1054 38.9336 31.2695 38.0664 L 32.3241 33.0039 L 34.7617 33.0039 C 35.6757 33.0039 36.3320 32.3242 36.3320 31.4336 C 36.3320 30.6367 35.7695 30.0508 34.9960 30.0508 L 32.9570 30.0508 L 33.9648 25.2930 L 36.4492 25.2930 C 37.3398 25.2930 37.9960 24.6133 37.9960 23.7227 C 37.9960 22.9258 37.4335 22.3398 36.6601 22.3398 L 34.5742 22.3398 L 35.4882 17.9571 C 35.6757 16.9961 34.9726 16.1758 34.0117 16.1758 C 33.0976 16.1758 32.5117 16.6445 32.3241 17.5352 L 31.3163 22.3398 L 26.9570 22.3398 L 27.8710 17.9571 C 28.0585 17.0196 27.4023 16.1758 26.4179 16.1758 C 25.4804 16.1758 24.8944 16.6445 24.7070 17.5352 L 23.7226 22.3398 L 21.2382 22.3398 C 20.3476 22.3398 19.6913 23.0196 19.6913 23.9102 C 19.6913 24.7071 20.2539 25.2930 21.0273 25.2930 L 23.0898 25.2930 L 22.0820 30.0508 L 19.5742 30.0508 C 18.6835 30.0508 18.0039 30.7305 18.0039 31.6211 C 18.0039 32.4180 18.5663 33.0039 19.3632 33.0039 L 21.4726 33.0039 L 20.5117 37.6211 C 20.3241 38.5820 21.0273 39.4023 21.9882 39.4023 Z M 25.1523 30.3320 L 26.2304 25.0586 L 30.9413 25.0586 L 29.8398 30.3320 Z"/></svg>` },
				{ key: `determiners`, name: `Определители`, icon: `<svg style="vertical-align:middle; fill:currentColor;" width="1.4em" height="1.4em" viewBox="0 0 512 512"><path d="M468.333,174.825H287.427c16.213-7.68,31.573-17.92,41.813-28.16c13.653-13.653,14.507-40.96,1.707-56.32 c-4.267-4.267-19.627-18.773-46.933,0.853c-25.6,17.92-81.92,32.427-114.347,32.427c-68.267,0-98.987,44.373-107.52,59.733H7.533 c-5.12,0-8.533,3.413-8.533,8.533s3.413,8.533,8.533,8.533h59.733c3.413,0,6.827-1.707,7.68-5.12 c0.853-2.56,25.6-54.613,94.72-54.613c31.573,0,93.867-13.653,124.587-35.84c7.68-5.973,17.92-11.093,23.893-3.413 c6.827,8.533,6.827,25.6-0.853,33.28c-21.333,21.333-66.56,40.107-87.893,40.107c-5.12,0-8.533,3.413-8.533,8.533 s3.413,8.533,8.533,8.533h238.933c11.947,0,25.6,9.387,25.6,21.333s-13.653,21.333-25.6,21.333H280.6 c-5.12,0-8.533,3.413-8.533,8.533s3.413,8.533,8.533,8.533h85.333c11.947,0,25.6,9.387,25.6,21.333s-13.653,21.333-25.6,21.333 h-93.867c-5.12,0-8.533,3.413-8.533,8.533s3.413,8.533,8.533,8.533H331.8c11.947,0,25.6,9.387,25.6,21.333 s-13.653,21.333-25.6,21.333h-40.96c-0.853,0-0.853,0-1.707,0H255c-5.12,0-8.533,3.413-8.533,8.533s3.413,8.533,8.533,8.533 h35.84c11.093,0.853,23.893,10.24,23.893,21.333c0,11.947-13.653,21.333-25.6,21.333H169.667c-64.853,0-64.853,0-97.28-23.893 c-1.707-1.707-4.267-1.707-5.973-1.707H7.533c-5.12,0-8.533,3.413-8.533,8.533s3.413,8.533,8.533,8.533h57.173 c32.427,23.893,38.4,25.6,93.013,25.6c3.413,0,7.68,0,11.947,0h119.467c20.48,0,42.667-16.213,42.667-38.4 c0-7.68-2.56-15.36-7.68-21.333h7.68c20.48,0,42.667-16.213,42.667-38.4c0-7.68-2.56-15.36-7.68-21.333 c19.627,0,41.813-17.067,41.813-38.4c0-7.68-2.56-15.36-7.68-21.333h67.413c20.48,0,42.667-16.213,42.667-38.4 C511,191.038,488.813,174.825,468.333,174.825z"/><path d="M92.867,302.825v-25.6c0-5.12-3.413-8.533-8.533-8.533c-5.12,0-8.533,3.413-8.533,8.533v25.6 c0,5.12,3.413,8.533,8.533,8.533C89.453,311.358,92.867,307.945,92.867,302.825z"/><path d="M58.733,311.358v-42.667c0-5.12-3.413-8.533-8.533-8.533s-8.533,3.413-8.533,8.533v42.667 c0,5.12,3.413,8.533,8.533,8.533S58.733,316.478,58.733,311.358z"/></svg>` },
				{ key: `interjections`, name: `Междометия`, icon: `<svg style="vertical-align:middle; fill:currentColor;" width="1.4em" height="1.4em" viewBox="0 0 512 512"><path d="M346.067,178.269l-37.281-12.166l34.525-33.224c3.638-3.501,4.481-8.668,2.149-13.162c-2.331-4.491-7.038-6.771-12-5.813 l-53.324,10.341l6.363-35.581c0.852-4.76-1.339-9.354-5.582-11.702c-4.241-2.348-9.296-1.765-12.881,1.483l-30.017,27.223 l-31.71-40.28c-3.344-4.251-8.859-5.481-13.718-3.061c-4.857,2.417-7.197,7.555-5.821,12.788l11.44,43.542l-32.021,0.468 c-4.916,0.072-9.028,3.163-10.476,7.875c-1.449,4.713,0.218,9.581,4.245,12.402l23.095,16.172l-37.844,17.253 c-4.6,2.098-7.109,6.697-6.393,11.716c0.716,5.018,4.412,8.731,9.416,9.458l56.206,8.166l-12.394,46.261 c-1.248,4.659,0.536,9.416,4.548,12.119c4.006,2.702,9.085,2.568,12.936-0.338l29.456-22.24l11.002,42.608 c1.271,4.922,5.71,8.359,10.793,8.359l0.143-0.001c5.075-0.065,9.458-3.537,10.678-8.471l9.238-37.363l33.47,26.433l13.198-20.019 l-20.472-38.163l38.819-11.823c4.739-1.443,7.833-5.586,7.882-10.553C353.788,184.01,350.776,179.806,346.067,178.269z M287.543,193.985c-3.205,0.975-5.776,3.313-7.056,6.412c-1.278,3.099-1.103,6.57,0.482,9.522l4.537,8.457l-4.424-3.495 c-2.985-2.357-6.917-3.029-10.517-1.795c-3.604,1.233-6.3,4.174-7.213,7.867l-2.804,11.34l-4.151-16.076 c-0.933-3.614-3.594-6.504-7.118-7.733c-1.203-0.419-2.449-0.626-3.685-0.626c-2.388,0-4.745,0.768-6.706,2.25l-16.916,12.772 l7.248-27.057c0.823-3.071,0.292-6.356-1.457-9.013c-1.75-2.658-4.56-4.446-7.709-4.904l-31.105-4.519l21.097-9.617 c3.681-1.678,6.101-5.09,6.471-9.125c0.37-4.034-1.388-7.828-4.702-10.149l-10.831-7.584l11.791-0.172 c3.448-0.05,6.621-1.655,8.71-4.403c2.088-2.747,2.783-6.237,1.907-9.575l-1.433-5.453l5.937,7.542 c1.905,2.419,4.758,3.954,7.829,4.212c3.059,0.261,6.136-0.781,8.418-2.849L258.8,116.92l-3.47,19.403 c-0.646,3.618,0.533,7.32,3.154,9.901c2.62,2.58,6.338,3.701,9.941,3.003l32.247-6.254l-20.717,19.937 c-2.844,2.736-4.014,6.67-3.131,10.524c0.882,3.851,3.649,6.881,7.402,8.106l21.329,6.959L287.543,193.985z"/><circle cx="85.886" cy="237.693" r="26.651"></circle><path d="M237.78,394.875l-51.822-26.342c-2.169-1.103-4.567-1.676-6.998-1.676c-0.046,0-0.09,0-0.136,0l-76.669,0.702 l58.235-12.981l10.06-9.659l2.484,6.996c6.099-0.056,12.16-0.645,19.818,3.25l17.186,8.737l-18.556-52.268 c-1.768-4.983-5.966-8.713-11.122-9.884c-5.156-1.17-10.553,0.378-14.302,4.107l-22.805,22.687 c-5.397-21.941-3.518-14.304-8.476-34.467c27.494-7.605,24.589-6.801,33.071-9.148c5.631-1.557,9.504-6.715,9.431-12.556 l-0.579-46.062c-0.087-6.977-5.786-12.698-12.855-12.698c-0.054,0-0.11,0-0.165,0.001c-7.183,0.09-12.785,6.046-12.696,13.021 l0.455,36.148l-27.106,7.498c-4.105-2.875-9.374-4.044-14.622-2.754c-34.267,8.427-31.755,7.727-33.61,8.474l13,6.529 l-47.831-10.208c-17.47-44.218-16.391-41.628-17.006-42.769c-3.172-5.859-10.136-8.164-16.024-5.837 c-6.543,2.585-9.858,10.048-7.235,16.685c2.555,6.468,16.836,42.615,18.878,47.782c1.586,4.013,5.071,6.954,9.276,7.851 l52.818,11.272l-14.015,0.286c1.915,7.787,17.232,70.067,19.597,79.687l0.023-0.03c1.896,6.606,8,11.251,14.961,11.171 l72.898-0.668l48.459,24.633c7.614,3.869,16.895,0.817,20.749-6.763C248.405,408.025,245.377,398.736,237.78,394.875z"/><path d="M349.912,386.86l-23.276-24.687l-1.597,12.765L279.241,403.7c-8.075,5.071-10.508,15.727-5.439,23.801 c5.076,8.081,15.735,10.505,23.801,5.438c57.7-36.238,53.557-33.466,55.396-35.204L349.912,386.86z"/><path d="M442.107,159.875c-13.748-9.062-32.24-5.264-41.303,8.484c-9.076,13.766-5.234,32.26,8.483,41.303 c13.712,9.038,32.225,5.289,41.304-8.483C459.654,187.431,455.855,168.939,442.107,159.875z"/><path d="M508.684,201.854c-5.075-6.116-14.146-6.957-20.257-1.884l-34.476,28.61c-18.019,0.33-14.188,0.26-31.91,0.585 c-1.899-1.806,0.115-0.327-32.793-22.02c-9.295-6.127-21.785-3.548-27.901,5.731l-57.258,86.859l0.043-0.004 c-3.918,6.472-3.244,15,2.197,20.772l55.948,59.34l16.604,58.503c2.611,9.196,12.174,14.49,21.32,11.894 c9.173-2.604,14.497-12.149,11.894-21.32l-17.757-62.563c-0.756-2.667-2.146-5.112-4.046-7.129l-58.842-62.409l45.442,30.924 l19.732-29.933l-18.459-44.44l34.989,48.236c2.91,3.896,7.639,6.014,12.316,5.759l58.54-3.18 c7.928-0.433,14.017-7.223,13.578-15.151c-0.446-8.164-7.655-14.114-15.151-13.578l-49.689,2.718l-32.726-43.847l29.37,23.481 c11.073-0.203,17.778-0.326,30.125-0.553c3.264-0.06,6.411-1.228,8.922-3.313l38.356-31.831 C512.915,217.037,513.758,207.968,508.684,201.854z"/></svg>` },
			] as any[],

			words: [
				{ name: `arouse`, 				trans: `[əˈraʊz]`, 					translation: `вызывать, пробуждать`, 						progress: 97, },
				{ name: `pretty`, 				trans: `[ˈprɪti]`, 					translation: `довольно-таки`, 								progress: 100, },
				{ name: `grand`, 				trans: `[grænd]`, 					translation: `большой, великий`, 							progress: 101, },
				{ name: `volume`, 				trans: `[ˈvɒljʊm]`, 				translation: `громкость`, 									progress: 101, },
				{ name: `draw, (drew, drawn)`,	trans: `[drɔː]`, 					translation: `тянуть`, 										progress: 101, },
				{ name: `coach`, 				trans: `[kəʊʧ]`, 					translation: `автобус, вагон, телега`, 						progress: 101, },
				{ name: `provide`, 				trans: `[prəˈvaɪd]`, 				translation: `обеспечивать, снабжать`, 						progress: 101, },
				// provider [prəˈvaɪdə] поставщик
				// provision [prəˈvɪʒən] обеспечение
				{ name: `cope with`, 			trans: `[kəʊpwɪð]`,					translation: `совладать, справиться`, 						progress: 101, },
				{ name: `condition`, 			trans: `[kənˈdɪʃən]`, 				translation: `состояние`, 									progress: 101, },
				{ name: `land`, 				trans: `[lænd]`, 					translation: `приземляться, высаживаться`, 					progress: 101, },
				{ name: `scope`, 				trans: `[skəʊp]`, 					translation: `пределы, район`, 								progress: 101, },
				{ name: `pack`, 				trans: `[pæk]`, 					translation: `пачка, связка, колода, и т. д.`, 				progress: 101, },
				// package [ˈpækɪʤ] пакет
				{ name: `craft`, 				trans: `[krɑːft]`, 					translation: `ремесло, мастерство`, 						progress: 101, },
				// craftsman [ˈkrɑːftsmən] ремесленник
				// crafty [ˈkrɑːfti] ловкий, хитрый
				{ name: `worth`, 				trans: `[wɜːθ]`, 					translation: `стоимость, стоящий`, 							progress: 101, },
				// worthy [ˈwɜːði] достойный
				{ name: `urban`, 				trans: `[ˈɜːbən]`, 					translation: `городской`, 									progress: 101, },
				// urbanization [ˌɜːb(ə)naɪˈzeɪʃ(ə)n] урбанизация
				{ name: `pond`, 				trans: `[pɒnd]`, 					translation: `пруд`, 										progress: 101, },
				{ name: `familiar`, 			trans: `[fəˈmɪliə]`, 				translation: `знакомый`, 									progress: 101, },
				// familiarity [fəˌmɪlɪˈærɪti] знакомство
				// unfamiliar [ˌʌnfəˈmɪliə] незнакомый
				// familiarize [fəˈmɪliəraɪz] ознакомиться
				{ name: `tap`, 					trans: `[tæp]`, 					translation: `стучать`, 									progress: 101, },
				{ name: `column`, 				trans: `[ˈkɒləm]`, 					translation: `столб, колонна`, 								progress: 101, },
				{ name: `guilt`, 				trans: `[gɪlt]`, 					translation: `вина`, 										progress: 101, },
			],
		};
	},
	methods: {
		defineIcon(word: any) {
			if (word.progress > 100) {
				return 'check-blue';
			}
			else if (word.progress > 87) {
				return 'check-green';
			}
		}
	},
});
</script>

<style lang="scss">
.learn-page {
	.tags {
		display:flex;
		flex-wrap:wrap;
		gap:.6em;

		>div {
			line-height:2.8em;
			padding:0 1.2em;
			border-radius:11px;
			background:#f6f6f6;
			color:#02193d99;
			// color:#02193dcc;
			font-weight:400;
			font-size:14px;
			cursor:pointer;
		}

		.selected {
			// background:#589edb;
			background-color: #2186eb;
			color:#e8e8e8;
			font-weight:600;
		}
	}

	.words-list {
		max-width: 800px;
		margin:2em auto;
		.word {
			display:flex;
			justify-content:space-between;
			// line-height:3em;
			font-size:20px;
			font-weight:400;
			background:#f6f6f6;
			border-radius:10px;
			margin:.4em 0;
			padding:1em 1.2em;
			transition:all 300ms ease 0s;
			cursor: pointer;
			&:hover {
				background-color:#e8e8e8;
				.word-types {
					.word-type {
						filter: none !important;
					}
				}
			}

			.word-left-side {
				display:flex;

				.word-name {
					font-size:32px;
					padding:.2em 0;
					// line-height:1.6em;
				}
			}
			.word-right-side {
				display:flex;
				font-size: 14px;
				font-weight:400;
				opacity:.8;

				.word-types {
					display: flex;
					justify-content: end;
					align-items: end;
					font-size:.8em;
					font-weight:400;
					opacity:.8;

					.word-type {
						&:not(:first-child) {
							margin-left:.3em;
						}
						// vertical-align: baseline;
						display: inline-block;
						line-height: 1.4em;
						border-radius: 4px;
						padding:0 .6em;

						border-width:0 0 4px 0;
						border-style: solid;
						border-color: #09b35a;
						// border-left: 4px solid #09b35a;
						background:#00000008;
						color: #339c64;

					}
				}
				.word-translations {
					padding:.8em 0;
					text-align: right;

					.word-translation {
						line-height:1.4em;
					}
				}
			}
		}
	}
}
</style>
